getspekt/app/controllers/specs_controller.rb

  def show
    @spec = Spec.find(params[:id])
    @piece_id = SpecPiece.where(spec_id: @spec).select("piece_id")
    @pieces = Piece.where(id: @piece_id)
---
SELECT  "specs".* FROM "specs"  WHERE "specs"."id" = ? LIMIT 1  [["id", 1]]
SELECT "spec_pieces"."piece_id" FROM "spec_pieces"  WHERE "spec_pieces"."spec_id" = 2
SELECT "pieces".* FROM "pieces"  WHERE "pieces"."id" IN (SELECT "spec_pieces"."piece_id" FROM "spec_pieces"  WHERE "spec_pieces"."spec_id" = 3)